# Loading Libraries

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Loading Dataset

In [17]:
df = pd.read_csv(r'D:\Programacion\Datasets\ds_pay\ds_salaries.csv')

In [20]:
df

,work_year,experience_level,employment_type,job_title,salary,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,94665,IN,50,IN,L

In [18]:
df.drop(['salary','salary_currency'],axis=1,inplace=True)
df.rename({'salary_in_usd':'salary'},axis=1,inplace=True)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   employee_residence  3755 non-null   object
 6   remote_ratio        3755 non-null   int64
 7   company_location    3755 non-null   object
 8   company_size        3755 non-null   object
dtypes: int64(3), object(6)
memory usage: 264.2+ KB

# Data Cleaning

In [21]:
#Invalid Values
for col in df.select_dtypes(exclude='number').columns:
    print(df[col].value_counts(),end='\n\n')

experience_level
SE    2516
MI     805
EN     320
EX     114
Name: count, dtype: int64

employment_type
FT    3718
PT      17
CT      10
FL      10
Name: count, dtype: int64

job_title
Data Engineer                          1040
Data Scientist                          840
Data Analyst                            612
Machine Learning Engineer               289
Analytics Engineer                      103
                                       ...
Principal Machine Learning Engineer       1
Azure Data Engineer                       1
Manager Data Management                   1
Marketing Data Engineer                   1
Finance Data Analyst                      1
Name: count, Length: 93, dtype: int64

employee_residence
US    3004
GB     167
CA      85
ES      80
IN      71
      ...
BA       1
AM       1
CY       1
KW       1
MT       1
Name: count, Length: 78, dtype: int64

company_location
US    3040
GB     172
CA      87
ES      77
IN      58
      ...
MK       1
BS       1
IR       1
CR       1
MT       1
Name: count, Length: 72, dtype: int64

company_size
M    3153
L     454
S     148
Name: count, dtype: int64

In [22]:
print(f'Min and max work year: {df.work_year.min()} - {df.work_year.max()}')

Min and max work year: 2020 - 2023

In [23]:
print(f'Min and max salary: {df.salary.min()} - {df.salary.max()}')

Min and max salary: 5132 - 450000

In [24]:
#Missing Values
df.isna().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

# EDA